Задание 1
Вывести имена всех людей, которые есть в базе данных авиакомпаний

In [ ]:
SELECT name
FROM Passenger

Задание 2
Вывести названия всеx авиакомпаний

In [ ]:
SELECT name
FROM Company

Задание 3
Вывести все рейсы, совершенные из Москвы

In [ ]:
SELECT *
FROM Trip
WHERE town_from = 'Moscow'

Задание 4
Вывести имена людей, которые заканчиваются на "man"

In [ ]:
SELECT name
FROM Passenger
WHERE name LIKE '%man'

Задание 5
Вывести количество рейсов, совершенных на TU-134

In [ ]:
SELECT COUNT(plane) AS count
FROM Trip
WHERE plane = 'TU-134'

Задание 6
Какие компании совершали перелеты на Boeing

In [ ]:
SELECT DISTINCT Company.name
FROM Trip
JOIN Company ON Trip.company = Company.id
WHERE Trip.plane = 'Boeing'

Задание 7
Вывести все названия самолётов, на которых можно улететь в Москву (Moscow)

In [ ]:
SELECT plane
FROM Trip
WHERE town_to = 'Moscow'
GROUP BY plane

Задание 8
В какие города можно улететь из Парижа (Paris) и сколько времени это займёт?

In [ ]:
SELECT town_to,
    TIMEDIFF(time_in, time_out) AS flight_time
FROM Trip
WHERE town_from = 'Paris'


Задание 9
Какие компании организуют перелеты из Владивостока (Vladivostok)?

In [ ]:
SELECT DISTINCT name
FROM Company
LEFT JOIN TRIP ON Company.id = Trip.company
WHERE town_from = 'Vladivostok'

Задание 10
Вывести вылеты, совершенные с 10 ч. по 14 ч. 1 января 1900 г.

In [ ]:
SELECT *
FROM Trip
WHERE time_out BETWEEN '1900-01-01T10:00:00.000Z' AND '1900-01-01T14:00:00.000Z'

Задание 11
Выведите пассажиров с самым длинным ФИО. Пробелы, дефисы и точки считаются частью имени.

In [ ]:
SELECT name
FROM passenger
WHERE LENGTH(name) = (
    SELECT MAX(LENGTH(name))
    FROM passenger);

Задание 12
Выведите идентификаторы всех рейсов и количество пассажиров на них. Обратите внимание, что на каких-то рейсах пассажиров может не быть. В этом случае выведите число "0".

In [ ]:
SELECT Trip.id, COALESCE(COUNT(Pass_in_trip.passenger), 0) AS count
FROM Trip
LEFT JOIN Pass_in_trip
    ON Trip.id = Pass_in_trip.trip
GROUP BY Trip.id;

Задание 13
Вывести имена людей, у которых есть полный тёзка среди пассажиров

In [ ]:
SELECT name
FROM Passenger
GROUP BY name
HAVING COUNT(*) > 1

Задание 14
В какие города летал Bruce Willis

In [ ]:
SELECT town_to
FROM Passenger
INNER JOIN Pass_in_trip
    ON Passenger.id = Pass_in_trip.passenger
INNER JOIN Trip
    ON Pass_in_trip.trip = Trip.id
WHERE Passenger.name = 'Bruce Willis'

Задание 15
Выведите идентификатор пассажира Стив Мартин (Steve Martin) и дату и время его прилёта в Лондон (London)

In [ ]:
SELECT Passenger.id AS id, Trip.time_in AS time_in
FROM Passenger
INNER JOIN Pass_in_trip
    ON Passenger.id = Pass_in_trip.passenger
INNER JOIN Trip
    ON Pass_in_trip.trip = Trip.id
WHERE Passenger.name = 'Steve Martin' AND town_to = 'London'

Задание 16
Вывести отсортированный по количеству перелетов (по убыванию) и имени (по возрастанию) список пассажиров, совершивших хотя бы 1 полет.

In [ ]:
SELECT name, COUNT(passenger) AS count
FROM Passenger
JOIN Pass_in_trip
    ON Passenger.id = Pass_in_trip.passenger
GROUP BY name
HAVING COUNT >= 1
ORDER BY count DESC, name

Задание 17
Определить, сколько потратил в 2005 году каждый из членов семьи. В результирующей выборке не выводите тех членов семьи, которые ничего не потратили.

In [ ]:
SELECT member_name,
    status,
    SUM(unit_price * amount) AS costs
FROM FamilyMembers
JOIN Payments
    ON FamilyMembers.member_id = Payments.family_member
WHERE date LIKE '2005%'
GROUP BY family_member

Задание 18
Выведите имя самого старшего человека. Если таких несколько, то выведите их всех.

In [ ]:
SELECT member_name
FROM FamilyMembers
WHERE TIMESTAMPDIFF(YEAR, birthday, NOW()) = 
    (SELECT MAX(TIMESTAMPDIFF(YEAR, birthday, NOW()))
    FROM FamilyMembers)

Задание 19
Определить, кто из членов семьи покупал картошку (potato)

In [ ]:
SELECT FamilyMembers.status
FROM FamilyMembers
INNER JOIN Payments
    ON FamilyMembers.member_id = Payments.family_member
INNER JOIN Goods
    ON Payments.good = Goods.good_id
WHERE good_name = 'potato'
GROUP BY FamilyMembers.status

Задание 20
Сколько и кто из семьи потратил на развлечения (entertainment). Вывести статус в семье, имя, сумму

In [ ]:
SELECT status,
    member_name,
    SUM(unit_price*amount) AS costs
FROM FamilyMembers
JOIN Payments
    ON FamilyMembers.member_id = Payments.family_member
JOIN Goods
    ON Payments.good = Goods.good_id
JOIN GoodTypes
    ON Goods.type = GoodTypes.good_type_id
WHERE good_type_name = 'entertainment'
GROUP BY family_member

Задание 21
Определить товары, которые покупали более 1 раза

In [ ]:
SELECT good_name
FROM Goods
LEFT JOIN Payments
    ON Goods.good_id = Payments.good
GROUP BY good_name
HAVING COUNT(good_name) > 1

Задание 22
Найти имена всех матерей (mother)

In [ ]:
SELECT member_name
FROM FamilyMembers
WHERE status = 'mother'

Задание 23
Найдите самый дорогой деликатес (delicacies) и выведите его цену

In [ ]:
SELECT good_name, unit_price
FROM Payments
JOIN Goods
    ON Payments.good = Goods.good_id
JOIN GoodTypes
    ON Goods.type = GoodTypes.good_type_id
WHERE good_type_name = 'delicacies' 
ORDER BY unit_price DESC 
LIMIT 1

Задание 24
Определить кто и сколько потратил в июне 2005

In [ ]:
SELECT member_name,
    SUM(unit_price * amount) AS costs
FROM FamilyMembers
JOIN Payments
    ON FamilyMembers.member_id = Payments.family_member
WHERE date LIKE '2005%' AND MONTH(date) = 6
GROUP BY family_member

Задание 25
Определить, какие товары не покупались в 2005 году

In [ ]:
SELECT good_name
FROM Goods
WHERE good_id NOT IN (
		SELECT good
		FROM Payments
		WHERE YEAR(date) = '2005');

Задание 26
Определить группы товаров, которые не приобретались в 2005 году

In [ ]:
SELECT good_type_name
FROM GoodTypes
WHERE good_type_id NOT IN(
		SELECT TYPE
		FROM Goods AS g
			JOIN Payments AS p ON p.good = g.good_id
		WHERE YEAR(date) = '2005');

Задание 27
Узнайте, сколько было потрачено на каждую из групп товаров в 2005 году. Выведите название группы и потраченную на неё сумму. Если потраченная сумма равна нулю, т.е. товары из этой группы не покупались в 2005 году, то не выводите её.

In [ ]:
SELECT good_type_name, SUM(amount * unit_price) AS costs
FROM GoodTypes AS gt
    JOIN Goods AS g ON g.type = gt.good_type_id
    JOIN Payments AS p ON p.good = g.good_id
WHERE YEAR(date) = '2005'
GROUP BY good_type_name;

Задание 28
Сколько рейсов совершили авиакомпании из Ростова (Rostov) в Москву (Moscow) ?

In [ ]:
SELECT COUNT(company) AS count
FROM  Trip
WHERE town_from = 'Rostov' AND town_to = 'Moscow'

Задание 29
Выведите имена пассажиров улетевших в Москву (Moscow) на самолете TU-134. В ответе не должно быть дубликатов.

In [ ]:
SELECT DISTINCT name
FROM Passenger
JOIN Pass_in_trip
    ON Passenger.id = Pass_in_trip.passenger
JOIN Trip
    ON Pass_in_trip.trip = Trip.id
WHERE town_to = 'Moscow' AND plane = 'TU-134'

Задание 30
Выведите нагруженность (число пассажиров) каждого рейса (trip). Результат вывести в отсортированном виде по убыванию нагруженности.

In [ ]:
SELECT COUNT(passenger) AS count, trip
FROM Pass_in_trip
GROUP BY trip
ORDER BY count DESC

Задание 31
Вывести всех членов семьи с фамилией Quincey.

In [ ]:
SELECT *
FROM FamilyMembers
WHERE member_name LIKE '%Quincey%'

Задание 32
Вывести средний возраст людей (в годах), хранящихся в базе данных. Результат округлите до целого в меньшую сторону.

In [ ]:
SELECT TRUNCATE(AVG(TIMESTAMPDIFF(YEAR, birthday, NOW())), 0) AS age 
FROM FamilyMembers

Задание 33
Найдите среднюю цену икры на основе данных, хранящихся в таблице Payments. В базе данных хранятся данные о покупках красной (red caviar) и черной икры (black caviar). В ответе должна быть одна строка со средней ценой всей купленной когда-либо икры.

In [ ]:
SELECT AVG(unit_price) AS cost
FROM Payments
	JOIN Goods ON Payments.good = Goods.good_id
WHERE good_name IN('red caviar', 'black caviar')

Задание 34
Сколько всего 10-ых классов

In [ ]:
SELECT COUNT(name) AS count
FROM Class
WHERE name LIKE '10%'

Задание 35
Сколько различных кабинетов школы использовались 2 сентября 2019 года для проведения занятий?

In [ ]:
SELECT COUNT(DISTINCT classroom) AS count 
FROM Schedule
WHERE date = '2019-09-02T00:00:00.000Z'

Задание 36
Выведите информацию об обучающихся живущих на улице Пушкина (ul. Pushkina)?

In [ ]:
SELECT *
FROM Student
WHERE address LIKE '%ul. Pushkina%'

Задание 37
Сколько лет самому молодому обучающемуся ?

In [ ]:
SELECT TIMESTAMPDIFF(YEAR, birthday, NOW()) AS year
FROM Student
ORDER BY year
LIMIT 1

Задание 38
Сколько Анн (Anna) учится в школе ?

In [ ]:
SELECT COUNT(first_name) AS count
FROM Student
WHERE first_name = 'Anna'

Задание 39
Сколько обучающихся в 10 B классе ?

In [ ]:
SELECT COUNT(student) AS count
FROM Student_in_class
INNER JOIN Class
    ON Student_in_class.class = Class.id
WHERE name = '10 B'

Задание 40
Выведите название предметов, которые преподает Ромашкин П.П. (Romashkin P.P.). Обратите внимание, что в базе данных есть несколько учителей с такой фамилией.

In [ ]:
SELECT name AS subjects
FROM Schedule Sc 
JOIN Subject S 
    ON Sc.subject = S.id
JOIN Teacher T 
    ON Sc.teacher = T.id
WHERE last_name = 'Romashkin' AND first_name LIKE 'P%' AND middle_name LIKE 'P%'

Задание 41
Выясните, во сколько по расписанию начинается четвёртое занятие.

In [ ]:
SELECT DISTINCT start_pair
FROM Timepair
INNER JOIN Schedule
    ON Timepair.ID = Schedule.number_pair
WHERE number_pair = '4'

Задание 42
Сколько времени обучающийся будет находиться в школе, учась со 2-го по 4-ый уч. предмет?

In [ ]:
SELECT DISTINCT TIMEDIFF(
    (SELECT end_pair 
    FROM Timepair 
    WHERE id = 4),
    (SELECT start_pair 
    FROM Timepair 
    WHERE id = 2)) AS time
FROM Timepair

Задание 43
Выведите фамилии преподавателей, которые ведут физическую культуру (Physical Culture). Отсортируйте преподавателей по фамилии в алфавитном порядке.

In [ ]:
SELECT last_name
FROM Teacher
JOIN Schedule 
    ON Teacher.id = Schedule.teacher
JOIN Subject
    ON Schedule.subject = Subject.id
WHERE Subject.name = 'Physical Culture'
ORDER BY last_name

Задание 44
Найдите максимальный возраст (количество лет) среди обучающихся 10 классов на сегодняшний день. Для получения текущих даты и времени используйте функцию NOW().

In [ ]:
SELECT MAX(TIMESTAMPDIFF(YEAR, birthday, NOW())) AS max_year
FROM Student AS st
	JOIN Student_in_class sc ON sc.student = st.id
	JOIN Class cl ON cl.id = sc.class
WHERE name LIKE '10 %';

Задание 45
Какие кабинеты чаще всего использовались для проведения занятий? Выведите те, которые использовались максимальное количество раз.

In [ ]:
SELECT classroom
FROM Schedule
GROUP BY classroom
HAVING COUNT(classroom) = ( 
    SELECT COUNT(classroom) AS COUNT
	FROM Schedule
	GROUP BY classroom
	ORDER BY COUNT DESC LIMIT 1)

Задание 46
В каких классах введет занятия преподаватель "Krauze" ?

In [ ]:
SELECT name
FROM Class
JOIN Schedule
    ON Class.id = Schedule.class
JOIN Teacher
    ON Schedule.teacher = Teacher.id
WHERE last_name = 'Krauze'
GROUP BY  name